nxp-zephyr/hal_nxp/dts/nxp/kinetis/KW45B41Z83AFTA-pinctrl.h
/*
 * NOTE: Autogenerated file by kinetis_cfg_utils.py
 * for KW45B41Z83AFTA/signal_configuration.xml
 *
 *
 */

#ifndef _ZEPHYR_DTS_BINDING_KW45B41Z83AFTA_
#define _ZEPHYR_DTS_BINDING_KW45B41Z83AFTA_

#define KINETIS_MUX(port, pin, mux)		\
	(((((port) - 'A') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0xF) << 8))

#define PTA0 KINETIS_MUX('A',0,1) /* PTA0 */
#define WUU0_P0_PTA0 KINETIS_MUX('A',0,1) /* PTA0 */
#define WUU0_P27_PTA0 KINETIS_MUX('A',0,2) /* PTA0 */
#define CMP0_OUT_PTA0 KINETIS_MUX('A',0,2) /* PTA0 */
#define LPUART0_CTS_b_PTA0 KINETIS_MUX('A',0,3) /* PTA0 */
#define RF_GPO_11_PTA0 KINETIS_MUX('A',0,4) /* PTA0 */
#define TPM0_CH4_PTA0 KINETIS_MUX('A',0,5) /* PTA0 */
#define FLEXIO0_D0_PTA0 KINETIS_MUX('A',0,6) /* PTA0 */
#define SWD_DIO_PTA0 KINETIS_MUX('A',0,7) /* PTA0 */
#define PTA1 KINETIS_MUX('A',1,1) /* PTA1 */
#define CMP1_OUT_PTA1 KINETIS_MUX('A',1,2) /* PTA1 */
#define WUU0_P28_PTA1 KINETIS_MUX('A',1,2) /* PTA1 */
#define LPUART0_RTS_b_PTA1 KINETIS_MUX('A',1,3) /* PTA1 */
#define RF_GPO_10_PTA1 KINETIS_MUX('A',1,4) /* PTA1 */
#define TPM0_CH5_PTA1 KINETIS_MUX('A',1,5) /* PTA1 */
#define FLEXIO0_D1_PTA1 KINETIS_MUX('A',1,6) /* PTA1 */
#define SWD_CLK_PTA1 KINETIS_MUX('A',1,7) /* PTA1 */
#define ADC0_A10_PTA4 KINETIS_MUX('A',4,0) /* PTA4 */
#define CMP0_IN0_PTA4 KINETIS_MUX('A',4,0) /* PTA4 */
#define PTA4 KINETIS_MUX('A',4,1) /* PTA4 */
#define WUU0_P2_PTA4 KINETIS_MUX('A',4,1) /* PTA4 */
#define RF_GPO_9_PTA4 KINETIS_MUX('A',4,3) /* PTA4 */
#define TPM0_CLKIN_PTA4 KINETIS_MUX('A',4,4) /* PTA4 */
#define TRACE_SWO_PTA4 KINETIS_MUX('A',4,5) /* PTA4 */
#define FLEXIO0_D4_PTA4 KINETIS_MUX('A',4,6) /* PTA4 */
#define BOOT_CONFIG_PTA4 KINETIS_MUX('A',4,7) /* PTA4 */
#define ADC0_A12_PTA16 KINETIS_MUX('A',16,0) /* PTA16 */
#define PTA16 KINETIS_MUX('A',16,1) /* PTA16 */
#define LPSPI0_PCS0_PTA16 KINETIS_MUX('A',16,2) /* PTA16 */
#define EWM0_OUT_b_PTA16 KINETIS_MUX('A',16,3) /* PTA16 */
#define LPI2C0_SCLS_PTA16 KINETIS_MUX('A',16,4) /* PTA16 */
#define TPM0_CH4_PTA16 KINETIS_MUX('A',16,5) /* PTA16 */
#define LPUART0_RX_PTA16 KINETIS_MUX('A',16,6) /* PTA16 */
#define RF_GPO_8_PTA16 KINETIS_MUX('A',16,7) /* PTA16 */
#define FLEXIO0_D5_PTA16 KINETIS_MUX('A',16,9) /* PTA16 */
#define ADC0_A13_PTA17 KINETIS_MUX('A',17,0) /* PTA17 */
#define PTA17 KINETIS_MUX('A',17,1) /* PTA17 */
#define WUU0_P3_PTA17 KINETIS_MUX('A',17,1) /* PTA17 */
#define LPSPI0_SIN_PTA17 KINETIS_MUX('A',17,2) /* PTA17 */
#define EWM0_IN_PTA17 KINETIS_MUX('A',17,3) /* PTA17 */
#define LPI2C0_SDAS_PTA17 KINETIS_MUX('A',17,4) /* PTA17 */
#define TPM0_CH5_PTA17 KINETIS_MUX('A',17,5) /* PTA17 */
#define LPUART0_TX_PTA17 KINETIS_MUX('A',17,6) /* PTA17 */
#define RF_GPO_7_PTA17 KINETIS_MUX('A',17,7) /* PTA17 */
#define RF_GPO_8_PTA17 KINETIS_MUX('A',17,8) /* PTA17 */
#define FLEXIO0_D6_PTA17 KINETIS_MUX('A',17,9) /* PTA17 */
#define RF_EXT_XTAL_REQUEST_PTA17 KINETIS_MUX('A',17,11) /* PTA17 */
#define CMP1_IN1_PTA18 KINETIS_MUX('A',18,0) /* PTA18 */
#define PTA18 KINETIS_MUX('A',18,1) /* PTA18 */
#define LPSPI0_SOUT_PTA18 KINETIS_MUX('A',18,2) /* PTA18 */
#define LPUART0_CTS_b_PTA18 KINETIS_MUX('A',18,3) /* PTA18 */
#define LPI2C0_SDA_PTA18 KINETIS_MUX('A',18,4) /* PTA18 */
#define TPM0_CH3_PTA18 KINETIS_MUX('A',18,5) /* PTA18 */
#define RF_GPO_0_PTA18 KINETIS_MUX('A',18,6) /* PTA18 */
#define LPUART0_RX_PTA18 KINETIS_MUX('A',18,10) /* PTA18 */
#define SPC0_LPREQ_PTA18 KINETIS_MUX('A',18,11) /* PTA18 */
#define CMP1_IN0_PTA19 KINETIS_MUX('A',19,0) /* PTA19 */
#define PTA19 KINETIS_MUX('A',19,1) /* PTA19 */
#define WUU0_P4_PTA19 KINETIS_MUX('A',19,1) /* PTA19 */
#define LPSPI0_SCK_PTA19 KINETIS_MUX('A',19,2) /* PTA19 */
#define LPUART0_RTS_b_PTA19 KINETIS_MUX('A',19,3) /* PTA19 */
#define LPI2C0_SCL_PTA19 KINETIS_MUX('A',19,4) /* PTA19 */
#define TPM0_CH2_PTA19 KINETIS_MUX('A',19,5) /* PTA19 */
#define RF_GPO_1_PTA19 KINETIS_MUX('A',19,6) /* PTA19 */
#define ADC0_A14_PTA20 KINETIS_MUX('A',20,0) /* PTA20 */
#define CMP0_IN3_PTA20 KINETIS_MUX('A',20,0) /* PTA20 */
#define PTA20 KINETIS_MUX('A',20,1) /* PTA20 */
#define LPSPI0_PCS2_PTA20 KINETIS_MUX('A',20,2) /* PTA20 */
#define LPUART0_TX_PTA20 KINETIS_MUX('A',20,3) /* PTA20 */
#define EWM0_IN_PTA20 KINETIS_MUX('A',20,4) /* PTA20 */
#define TPM0_CH1_PTA20 KINETIS_MUX('A',20,5) /* PTA20 */
#define RF_GPO_2_PTA20 KINETIS_MUX('A',20,6) /* PTA20 */
#define FLEXIO0_D7_PTA20 KINETIS_MUX('A',20,8) /* PTA20 */
#define CMP0_IN2_PTA21 KINETIS_MUX('A',21,0) /* PTA21 */
#define ADC0_A15_PTA21 KINETIS_MUX('A',21,0) /* PTA21 */
#define WUU0_P5_PTA21 KINETIS_MUX('A',21,1) /* PTA21 */
#define PTA21 KINETIS_MUX('A',21,1) /* PTA21 */
#define LPSPI0_PCS3_PTA21 KINETIS_MUX('A',21,2) /* PTA21 */
#define LPUART0_RX_PTA21 KINETIS_MUX('A',21,3) /* PTA21 */
#define EWM0_OUT_b_PTA21 KINETIS_MUX('A',21,4) /* PTA21 */
#define TPM0_CH0_PTA21 KINETIS_MUX('A',21,5) /* PTA21 */
#define RF_GPO_3_PTA21 KINETIS_MUX('A',21,6) /* PTA21 */
#define RF_GPO_7_PTA21 KINETIS_MUX('A',21,7) /* PTA21 */
#define FLEXIO0_D8_PTA21 KINETIS_MUX('A',21,8) /* PTA21 */
#define RF_GPO_10_PTA21 KINETIS_MUX('A',21,9) /* PTA21 */
#define ADC0_B10_PTB0 KINETIS_MUX('B',0,0) /* PTB0 */
#define PTB0 KINETIS_MUX('B',0,1) /* PTB0 */
#define WUU0_P13_PTB0 KINETIS_MUX('B',0,1) /* PTB0 */
#define LPSPI1_PCS0_PTB0 KINETIS_MUX('B',0,2) /* PTB0 */
#define TPM1_CH0_PTB0 KINETIS_MUX('B',0,5) /* PTB0 */
#define FLEXIO0_D26_PTB0 KINETIS_MUX('B',0,9) /* PTB0 */
#define ADC0_B11_PTB1 KINETIS_MUX('B',1,0) /* PTB1 */
#define PTB1 KINETIS_MUX('B',1,1) /* PTB1 */
#define LPSPI1_SIN_PTB1 KINETIS_MUX('B',1,2) /* PTB1 */
#define TPM1_CH1_PTB1 KINETIS_MUX('B',1,5) /* PTB1 */
#define FLEXIO0_D27_PTB1 KINETIS_MUX('B',1,9) /* PTB1 */
#define ADC0_B12_PTB2 KINETIS_MUX('B',2,0) /* PTB2 */
#define PTB2 KINETIS_MUX('B',2,1) /* PTB2 */
#define LPSPI1_SCK_PTB2 KINETIS_MUX('B',2,2) /* PTB2 */
#define LPUART1_TX_PTB2 KINETIS_MUX('B',2,3) /* PTB2 */
#define TPM1_CH2_PTB2 KINETIS_MUX('B',2,5) /* PTB2 */
#define FLEXIO0_D28_PTB2 KINETIS_MUX('B',2,9) /* PTB2 */
#define ADC0_B13_PTB3 KINETIS_MUX('B',3,0) /* PTB3 */
#define PTB3 KINETIS_MUX('B',3,1) /* PTB3 */
#define WUU0_P14_PTB3 KINETIS_MUX('B',3,1) /* PTB3 */
#define LPSPI1_SOUT_PTB3 KINETIS_MUX('B',3,2) /* PTB3 */
#define LPUART1_RX_PTB3 KINETIS_MUX('B',3,3) /* PTB3 */
#define TPM1_CH3_PTB3 KINETIS_MUX('B',3,5) /* PTB3 */
#define FLEXIO0_D29_PTB3 KINETIS_MUX('B',3,9) /* PTB3 */
#define WUU0_P15_PTB4 KINETIS_MUX('B',4,1) /* PTB4 */
#define PTB4 KINETIS_MUX('B',4,1) /* PTB4 */
#define LPSPI1_PCS3_PTB4 KINETIS_MUX('B',4,2) /* PTB4 */
#define LPUART1_CTS_b_PTB4 KINETIS_MUX('B',4,3) /* PTB4 */
#define LPI2C1_SDA_PTB4 KINETIS_MUX('B',4,4) /* PTB4 */
#define I3C0_SDA_PTB4 KINETIS_MUX('B',4,5) /* PTB4 */
#define TRGMUX0_IN0_PTB4 KINETIS_MUX('B',4,6) /* PTB4 */
#define FLEXIO0_D30_PTB4 KINETIS_MUX('B',4,9) /* PTB4 */
#define PTB5 KINETIS_MUX('B',5,1) /* PTB5 */
#define LPSPI1_PCS2_PTB5 KINETIS_MUX('B',5,2) /* PTB5 */
#define LPUART1_RTS_b_PTB5 KINETIS_MUX('B',5,3) /* PTB5 */
#define LPI2C1_SCL_PTB5 KINETIS_MUX('B',5,4) /* PTB5 */
#define I3C0_SCL_PTB5 KINETIS_MUX('B',5,5) /* PTB5 */
#define TRGMUX0_OUT0_PTB5 KINETIS_MUX('B',5,6) /* PTB5 */
#define FLEXIO0_D31_PTB5 KINETIS_MUX('B',5,9) /* PTB5 */
#define PTC0 KINETIS_MUX('C',0,1) /* PTC0 */
#define WUU0_P7_PTC0 KINETIS_MUX('C',0,1) /* PTC0 */
#define LPSPI1_PCS2_PTC0 KINETIS_MUX('C',0,2) /* PTC0 */
#define CAN0_TX_PTC0 KINETIS_MUX('C',0,3) /* PTC0 */
#define I3C0_SDA_PTC0 KINETIS_MUX('C',0,4) /* PTC0 */
#define TPM1_CH0_PTC0 KINETIS_MUX('C',0,5) /* PTC0 */
#define LPI2C1_SCL_PTC0 KINETIS_MUX('C',0,7) /* PTC0 */
#define FLEXIO0_D16_PTC0 KINETIS_MUX('C',0,9) /* PTC0 */
#define WUU0_P8_PTC1 KINETIS_MUX('C',1,1) /* PTC1 */
#define PTC1 KINETIS_MUX('C',1,1) /* PTC1 */
#define LPSPI1_PCS3_PTC1 KINETIS_MUX('C',1,2) /* PTC1 */
#define CAN0_RX_PTC1 KINETIS_MUX('C',1,3) /* PTC1 */
#define I3C0_SCL_PTC1 KINETIS_MUX('C',1,4) /* PTC1 */
#define TPM1_CH1_PTC1 KINETIS_MUX('C',1,5) /* PTC1 */
#define LPI2C1_SDA_PTC1 KINETIS_MUX('C',1,7) /* PTC1 */
#define FLEXIO0_D17_PTC1 KINETIS_MUX('C',1,9) /* PTC1 */
#define PTC2 KINETIS_MUX('C',2,1) /* PTC2 */
#define WUU0_P9_PTC2 KINETIS_MUX('C',2,1) /* PTC2 */
#define LPSPI1_SOUT_PTC2 KINETIS_MUX('C',2,2) /* PTC2 */
#define LPUART1_RX_PTC2 KINETIS_MUX('C',2,3) /* PTC2 */
#define LPI2C1_SCLS_PTC2 KINETIS_MUX('C',2,4) /* PTC2 */
#define TPM1_CH2_PTC2 KINETIS_MUX('C',2,5) /* PTC2 */
#define I3C0_PUR_PTC2 KINETIS_MUX('C',2,7) /* PTC2 */
#define FLEXIO0_D18_PTC2 KINETIS_MUX('C',2,9) /* PTC2 */
#define PTC3 KINETIS_MUX('C',3,1) /* PTC3 */
#define LPSPI1_SCK_PTC3 KINETIS_MUX('C',3,2) /* PTC3 */
#define LPUART1_TX_PTC3 KINETIS_MUX('C',3,3) /* PTC3 */
#define LPI2C1_SDAS_PTC3 KINETIS_MUX('C',3,4) /* PTC3 */
#define TPM1_CH3_PTC3 KINETIS_MUX('C',3,5) /* PTC3 */
#define FLEXIO0_D19_PTC3 KINETIS_MUX('C',3,9) /* PTC3 */
#define WUU0_P10_PTC4 KINETIS_MUX('C',4,1) /* PTC4 */
#define PTC4 KINETIS_MUX('C',4,1) /* PTC4 */
#define LPSPI1_SIN_PTC4 KINETIS_MUX('C',4,2) /* PTC4 */
#define CAN0_TX_PTC4 KINETIS_MUX('C',4,3) /* PTC4 */
#define LPI2C1_SCL_PTC4 KINETIS_MUX('C',4,4) /* PTC4 */
#define TPM2_CH0_PTC4 KINETIS_MUX('C',4,6) /* PTC4 */
#define FLEXIO0_D20_PTC4 KINETIS_MUX('C',4,9) /* PTC4 */
#define PTC5 KINETIS_MUX('C',5,1) /* PTC5 */
#define LPSPI1_PCS0_PTC5 KINETIS_MUX('C',5,2) /* PTC5 */
#define CAN0_RX_PTC5 KINETIS_MUX('C',5,3) /* PTC5 */
#define LPI2C1_SDA_PTC5 KINETIS_MUX('C',5,4) /* PTC5 */
#define TPM1_CH4_PTC5 KINETIS_MUX('C',5,5) /* PTC5 */
#define TPM2_CH1_PTC5 KINETIS_MUX('C',5,6) /* PTC5 */
#define FLEXIO0_D21_PTC5 KINETIS_MUX('C',5,9) /* PTC5 */
#define ADC0_A8_PTC6 KINETIS_MUX('C',6,0) /* PTC6 */
#define PTC6 KINETIS_MUX('C',6,1) /* PTC6 */
#define WUU0_P11_PTC6 KINETIS_MUX('C',6,1) /* PTC6 */
#define LPSPI1_PCS1_PTC6 KINETIS_MUX('C',6,2) /* PTC6 */
#define TPM1_CH5_PTC6 KINETIS_MUX('C',6,5) /* PTC6 */
#define FLEXIO0_D22_PTC6 KINETIS_MUX('C',6,9) /* PTC6 */
#define PTC7 KINETIS_MUX('C',7,1) /* PTC7 */
#define WUU0_P12_PTC7 KINETIS_MUX('C',7,1) /* PTC7 */
#define TRGMUX0_IN3_PTC7 KINETIS_MUX('C',7,2) /* PTC7 */
#define TRGMUX0_OUT3_PTC7 KINETIS_MUX('C',7,3) /* PTC7 */
#define SFA0_CLK_PTC7 KINETIS_MUX('C',7,4) /* PTC7 */
#define TPM1_CLKIN_PTC7 KINETIS_MUX('C',7,5) /* PTC7 */
#define TPM2_CLKIN_PTC7 KINETIS_MUX('C',7,6) /* PTC7 */
#define CLKOUT_PTC7 KINETIS_MUX('C',7,7) /* PTC7 */
#define FLEXIO0_D23_PTC7 KINETIS_MUX('C',7,9) /* PTC7 */
#define ADC0_A5_PTD0 KINETIS_MUX('D',0,0) /* PTD0 */
#define PTD0 KINETIS_MUX('D',0,1) /* PTD0 */
#define RESET_b_PTD0 KINETIS_MUX('D',0,3) /* PTD0 */
#define ADC0_B5_PTD1 KINETIS_MUX('D',1,0) /* PTD1 */
#define PTD1 KINETIS_MUX('D',1,1) /* PTD1 */
#define SPC0_LPREQ_PTD1 KINETIS_MUX('D',1,2) /* PTD1 */
#define NMI_b_PTD1 KINETIS_MUX('D',1,3) /* PTD1 */
#define RF_GPO_4_PTD1 KINETIS_MUX('D',1,4) /* PTD1 */
#define ADC0_A6_PTD2 KINETIS_MUX('D',2,0) /* PTD2 */
#define PTD2 KINETIS_MUX('D',2,1) /* PTD2 */
#define LPTMR0_ALT3_PTD2 KINETIS_MUX('D',2,2) /* PTD2 */
#define TAMPER0_PTD2 KINETIS_MUX('D',2,3) /* PTD2 */
#define RF_GPO_5_PTD2 KINETIS_MUX('D',2,4) /* PTD2 */
#define ADC0_B6_PTD3 KINETIS_MUX('D',3,0) /* PTD3 */
#define PTD3 KINETIS_MUX('D',3,1) /* PTD3 */
#define LPTMR1_ALT3_PTD3 KINETIS_MUX('D',3,2) /* PTD3 */
#define TAMPER1_PTD3 KINETIS_MUX('D',3,3) /* PTD3 */
#define RF_GPO_6_PTD3 KINETIS_MUX('D',3,4) /* PTD3 */
#define TRGMUX0_IN2_PTD3 KINETIS_MUX('D',3,6) /* PTD3 */
#define XTAL32K_PTD4 KINETIS_MUX('D',4,0) /* PTD4 */
#define PTD4 KINETIS_MUX('D',4,1) /* PTD4 */
#define LPTMR0_ALT2_PTD4 KINETIS_MUX('D',4,2) /* PTD4 */
#define TAMPER2_PTD4 KINETIS_MUX('D',4,3) /* PTD4 */
#define EXTAL32K_PTD5 KINETIS_MUX('D',5,0) /* PTD5 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD5 */
#define LPTMR1_ALT2_PTD5 KINETIS_MUX('D',5,2) /* PTD5 */
#endif
